0marAmez/EmbeddedSystemsPSoC/Project2/CSE121-Lab6-PSoC/Lab6.1.cydsn/Generated_Source/PSoC6/I2C_ADXL.h
/*******************************************************************************
* Function Name: I2C_ADXL_SlaveGetAddressMask
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddressMask() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_ADXL_SlaveGetAddressMask(void)
{
    return Cy_SCB_I2C_SlaveGetAddressMask(I2C_ADXL_HW);
}
#endif /* (I2C_ADXL_ENABLE_SLAVE) */

#if (I2C_ADXL_ENABLE_MASTER)
/*******************************************************************************
* Function Name: I2C_ADXL_MasterSetLowPhaseDutyCycle
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSetLowPhaseDutyCycle() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ADXL_MasterSetLowPhaseDutyCycle(uint32_t clockCycles)
{
    Cy_SCB_I2C_MasterSetLowPhaseDutyCycle(I2C_ADXL_HW, clockCycles);
}


/*******************************************************************************
* Function Name: I2C_ADXL_MasterSetHighPhaseDutyCycle
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_MasterSetHighPhaseDutyCycle() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ADXL_MasterSetHighPhaseDutyCycle(uint32_t clockCycles)
{
    Cy_SCB_I2C_MasterSetHighPhaseDutyCycle(I2C_ADXL_HW, clockCycles);
}
#endif /* (I2C_ADXL_ENABLE_MASTER) */


#if (I2C_ADXL_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: I2C_ADXL_SlaveGetStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_ADXL_SlaveGetStatus(void)
{
    return Cy_SCB_I2C_SlaveGetStatus(I2C_ADXL_HW, &I2C_ADXL_context);
}


/*******************************************************************************
* Function Name: I2C_ADXL_SlaveConfigReadBuf
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveConfigReadBuf() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ADXL_SlaveConfigReadBuf(uint8_t *buffer, uint32_t size)
{
    Cy_SCB_I2C_SlaveConfigReadBuf(I2C_ADXL_HW, buffer, size, &I2C_ADXL_context);
}


/*******************************************************************************
* Function Name: I2C_ADXL_SlaveAbortRead
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveAbortRead() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ADXL_SlaveAbortRead(void)
{
    Cy_SCB_I2C_SlaveAbortRead(I2C_ADXL_HW, &I2C_ADXL_context);
}


/*******************************************************************************
* Function Name: I2C_ADXL_SlaveGetReadTransferCount
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetReadTransferCount() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_ADXL_SlaveGetReadTransferCount(void)
{
    return Cy_SCB_I2C_SlaveGetReadTransferCount(I2C_ADXL_HW, &I2C_ADXL_context);
}


/*******************************************************************************
* Function Name: I2C_ADXL_SlaveClearReadStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveClearReadStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_ADXL_SlaveClearReadStatus(void)
{
    return Cy_SCB_I2C_SlaveClearReadStatus(I2C_ADXL_HW, &I2C_ADXL_context);
}


/*******************************************************************************
* Function Name: I2C_ADXL_SlaveConfigWriteBuf
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveConfigWriteBuf() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ADXL_SlaveConfigWriteBuf(uint8_t *buffer, uint32_t size)
{
    Cy_SCB_I2C_SlaveConfigWriteBuf(I2C_ADXL_HW, buffer, size, &I2C_ADXL_context);
}


/*******************************************************************************
* Function Name: I2C_ADXL_SlaveAbortWrite
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveAbortWrite() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_ADXL_SlaveAbortWrite(void)
{
    Cy_SCB_I2C_SlaveAbortWrite(I2C_ADXL_HW, &I2C_ADXL_context);
}


/*******************************************************************************
* Function Name: I2C_ADXL_SlaveGetWriteTransferCount
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetWriteTransferCount() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_ADXL_SlaveGetWriteTransferCount(void)
{
    return Cy_SCB_I2C_SlaveGetWriteTransferCount(I2C_ADXL_HW, &I2C_ADXL_context);
}


/*******************************************************************************
* Function Name: I2C_ADXL_SlaveClearWriteStatus
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveClearWriteStatus() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_ADXL_SlaveClearWriteStatus(void)
{
    return Cy_SCB_I2C_SlaveClearWriteStatus(I2C_ADXL_HW, &I2C_ADXL_context);
}
#endif /* (I2C_ADXL_ENABLE_SLAVE) */


